app/Http/Controllers/FrontendController.php

select count(*) as aggregate from `parkings` where `status` = 'active'
select * from `parkings` where `status` = 'active' order by `id` desc limit 3
---
    public function parkingSearch(Request $request){
        $recent_parkings=ParkingDB::where('status','active')->orderBy('id','DESC')->limit(3)->get();
        $parkings=ParkingDB::orwhere('title','like','%'.$request->search.'%')
                    ->orwhere('slug','like','%'.$request->search.'%')
                    ->orwhere('description','like','%'.$request->search.'%')
                    ->orwhere('summary','like','%'.$request->search.'%')
                    ->orwhere('price','like','%'.$request->search.'%')
                    ->orderBy('id','DESC')
                    ->paginate('9');
        return view('frontend.pages.parking-grids')->with('parkings',$parkings)->with('recent_parkings',$recent_parkings);